-- MySQL dump 10.13  Distrib 8.0.21, for Win64 (x86_64)
--
-- Host: localhost    Database: citymap
-- ------------------------------------------------------
-- Server version	8.0.21

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `locations`
--

DROP TABLE IF EXISTS `locations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `locations` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `type` varchar(255) NOT NULL,
  `description` text,
  `address` varchar(255) NOT NULL,
  `image_path` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `latitude` double DEFAULT NULL,
  `longitude` double DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=65 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `locations`
--

LOCK TABLES `locations` WRITE;
/*!40000 ALTER TABLE `locations` DISABLE KEYS */;
INSERT INTO `locations` VALUES (1,'Эрмитаж','Музей','Один из крупнейших художественных музеев мира.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(2,'Красная площадь','Исторический','Знаменитая площадь в центре Москвы.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(3,'Большой театр','Театр','Известный театр оперы и балета.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(4,'Центральный парк','Парк','Большая зеленая зона в центре города.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(5,'ВДНХ','Выставка','Крупнейший выставочный центр.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(6,'Ресторан \"Ужин\"','Ресторан','Уютное место с вкусной едой.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(7,'Лужники','Стадион','Главный спортивный стадион Москвы.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(8,'Парк Победы','Парк','Место для прогулок и памятник Победы.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(9,'Московский зоопарк','Зоопарк','Один из старейших зоопарков России.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(10,'Третьяковская галерея','Музей','Галерея русского искусства.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(11,'Кремль','Исторический','Сердце Москвы, резиденция президента.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(12,'Летний сад','Парк','Известный исторический парк в Санкт-Петербурге.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(13,'Собор Василия Блаженного','Церковь','Один из самых узнаваемых символов России.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(14,'Останкинская башня','Памятник','Высокая телебашня с обзорной площадкой.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(15,'Музей науки','Музей','Интерактивные экспозиции для изучения науки.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(16,'Государственный музей','Музей','Художественные и исторические коллекции.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(17,'Таганский парк','Парк','Популярное место для семейного отдыха.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(18,'Храм Христа Спасителя','Церковь','Главный кафедральный собор Москвы.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(19,'Горьковский парк','Парк','Место отдыха с аттракционами и кафе.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(20,'Зоопарк Санкт-Петербурга','Зоопарк','Известный зоопарк с экзотическими животными.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(21,'Петропавловская крепость','Исторический','Исторический комплекс на Заячьем острове.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(22,'Дворцовая площадь','Исторический','Центральная площадь Санкт-Петербурга.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(23,'Мост Александра Невского','Мост','Крупный мост через Неву.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(24,'Торговый центр','Магазин','Место для шопинга и развлечений.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(25,'Смотровая площадка','Памятник','Панорамный вид на город.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(26,'Сад Эрмитаж','Парк','Тихий и уютный сад.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(27,'Музей космонавтики','Музей','Экспозиция о достижениях космоса.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(28,'Кинотеатр \"Октябрь\"','Кинотеатр','Популярный кинотеатр с современными залами.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(29,'Университет МГУ','Образовательный','Крупнейший университет России.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(30,'Ботанический сад','Парк','Коллекция растений со всего мира.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(31,'Московский цирк','Цирк','Захватывающие цирковые шоу.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(32,'Концертный зал','Концертный','Место для проведения музыкальных мероприятий.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(33,'Рынок Измайлово','Рынок','Популярное место для сувениров и ремесел.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(34,'Парк Зарядье','Парк','Современный парк в центре Москвы.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(35,'Музей архитектуры','Музей','Экспозиции, посвященные архитектуре.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(36,'Дельфинарий','Развлечения','Шоу с участием дельфинов.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(37,'Галерея современного искусства','Музей','Современные арт-выставки.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(38,'Ресторан \"Гурман\"','Ресторан','Известный ресторан высокой кухни.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(39,'Кремлевская набережная','Прогулка','Прекрасное место для вечерних прогулок.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(40,'Зал \"Арена\"','Спортивный','Спортивные мероприятия и концерты.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(41,'Музей воды','Музей','Интерактивные экспонаты о воде.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(42,'Тематический парк','Развлечения','Аттракционы и развлечения для всей семьи.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(43,'Торговый ряд','Магазин','Магазины и сувениры.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(44,'Площадь Европы','Площадь','Современная площадь с фонтанами.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(45,'Сад \"Таврический\"','Парк','Исторический сад в центре города.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(46,'Музей мультимедиа','Музей','Экспозиции о современных технологиях.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(47,'Казанский собор','Церковь','Крупный православный собор в Санкт-Петербурге.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(48,'Невский проспект','Прогулка','Главная улица Санкт-Петербурга, оживленное место.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(49,'Парк Сокольники','Парк','Огромный парк для отдыха и прогулок.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(50,'Московский Планетарий','Развлечения','Место для изучения астрономии с интересными шоу.','',NULL,'2024-11-29 07:44:05',NULL,NULL),(51,'ЛДПК','Музей','Колледж','',NULL,'2024-11-29 07:44:05',NULL,NULL),(52,'Выставка достижений народного хозяйства','Прогулка','выставочный комплекс в Останкинском районе Северо-Восточного административного округа города Москвы','','','2024-11-29 07:44:05',NULL,NULL),(53,'Церковь в деревне','Церковь','Деревянная церковь, на холме','','D:\\Khromushin\\city_map\\img\\vdnh.jpg','2024-11-29 07:51:26',NULL,NULL),(54,'Central Park','Park','A large city park','',NULL,'2024-11-29 09:28:06',NULL,NULL),(55,'Церковь','Церковь','11111','','','2024-12-06 08:55:10',NULL,NULL),(56,'Ликино-Дулевский Политехнический Колледж','Исторический','Место где можно учиться программированию!','','D:/Khromushin/city_map/img/mgu.jpg','2025-01-21 08:19:44',NULL,NULL),(57,'Парк Горького','Парк','Популярный парк с множеством аттракционов','Россия, Москва, Крымский Вал, 9','/images/park.jpg','2025-01-21 09:05:28',NULL,NULL),(58,'лдпк','Музей','МКРУТО','Первомайский переулок, 11',NULL,'2025-03-12 06:26:13',55.70583191056962,38.94901191814597),(60,'Дом Санька','Выставки','круто','улица Кирова, 21','C:/Users/admin/Pictures/Saved Pictures/256.jpg','2025-03-12 06:42:20',55.81467232656489,38.653737421170945),(61,'Памятник','Исторический','Большой памятник','улица Ленина','C:/Users/admin/Desktop/hq720.jpg','2025-03-12 07:02:22',55.79609356729151,38.972772248505834),(62,'Дом Ванька','Дикая природа','дооом','Заводская улица, 15','','2025-03-12 07:16:59',55.60473098744188,38.86593732550102),(63,'Дом Лизы','Кулинария','круто','улица Ленина, 2А','','2025-03-12 07:19:25',55.70557201270898,38.95699225921038),(64,'мойка абдурасула','Искусство','хорошо моют','Дрезна','C:/Users/admin/Desktop/hq720.jpg','2025-03-12 08:02:17',55.744498521488254,38.84582670687044);
/*!40000 ALTER TABLE `locations` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-03-12 11:26:46
